OdRxUnionTypeAttribute.createObject(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor. Creates an attribute that defines possible types of a property,
if it returns values of types void or OdRxObjectPtr.
\param typenames [in]  Semicolon separated list of possible types.
\returns
Smart pointer to a constructed attribute object.